Revit 2027 API
SpatialElementTag.MoveToReferenceLocation Method
 Moves the SpatialElementTag to the location of SpatialElement that the tag is associated with.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void MoveToReferenceLocation()
Public Sub MoveToReferenceLocation
public:
void MoveToReferenceLocation()
member MoveToReferenceLocation : unit -> unit
See Also
Reference
SpatialElementTag Class
Autodesk.Revit.DB Namespace